{
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "dtype": "float32",
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "Attack_High",
    "1": "Attack_Low",
    "2": "Attack_Medium",
    "3": "Bug_High",
    "4": "Bug_Low",
    "5": "Bug_Medium",
    "6": "Normal"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Attack_High": 0,
    "Attack_Low": 1,
    "Attack_Medium": 2,
    "Bug_High": 3,
    "Bug_Low": 4,
    "Bug_Medium": 5,
    "Normal": 6
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 514,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 6,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "transformers_version": "4.57.1",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 52000
}
